"OK" = "OK";

"Cancel" = "Cancel";

"YES" = "YES";

"NO" = "NO";

"Done" = "Done";

"Complete the SuDoku with the numbers 1 to 9 without repeating a number in any Column, Row, or 3x3 Grid.\nEvery SuDoku has just One solution.\nThis one is 'Simple' to get you started.\nGood Luck!" = "Complete the SuDoku with the numbers 1 to 9 without repeating a number in any Column, Row, or 3x3 Grid.\nEvery SuDoku has just One solution.\nThis one is 'Simple' to get you started.\nGood Luck!";

"RULES OF THE GAME" = "RULES OF THE GAME";

"Error" = "Error";

"Please start new game or enter your own to use this operation." = "Please start new game or enter your own to use this operation.";

"I want to learn the Art of SuDoku" = "I want to learn the Art of SuDoku";

"Beginner" = "Beginner";

"Apprentice" = "Apprentice";

"Novice" = "Novice";

"Expert" = "Expert";

"SuDoku Master!" = "SuDoku Master!";

"Please leave a review and let us know how we are doing. If there is enough interest then we will continue developing SuDoku. Would you like to leave a review now?" = "Please leave a review and let us know how we are doing. If there is enough interest then we will continue developing SuDoku. Would you like to leave a review now?";

"Please rate Sudoku if you like it and want us to keep updating it! Would you like to leave a review now?" = "Please rate Sudoku if you like it and want us to keep updating it! Would you like to leave a review now?";

"Are you ready to write a review for Sudoku? Great reviews lead to great updates!" = "Are you ready to write a review for Sudoku? Great reviews lead to great updates!";

"Congratulations!" = "Congratulations!";

"You solved it! However only the inbuilt SuDokus affect your rating." = "You solved it! However only the inbuilt SuDokus affect your rating.";

"You solved it! Try solving without using hints to improve your rating." = "You solved it! Try solving without using hints to improve your rating.";

"Your score has increased by %d\nYour score is now: %d\nRating: %@\nYou have completed:\n%d Simple SuDoku(s)\n%d Easy SuDoku(s)\n%d Medium SuDoku(s)\n%d Hard SuDoku(s)\n%d Very Hard SuDoku(s)\n%d Master SuDoku(s)" = "Your score has increased by %d\nYour score is now: %d\nRating: %@\nYou have completed:\n%d Simple SuDoku(s)\n%d Easy SuDoku(s)\n%d Medium SuDoku(s)\n%d Hard SuDoku(s)\n%d Very Hard SuDoku(s)\n%d Master SuDoku(s)";

"Enetered Sudoku is invalid. They have no or more than 1 solution. Please enter valid sudoku or start new game." = "Enetered Sudoku is invalid. They have no or more than 1 solution. Please enter valid sudoku or start new game.";

"Information" = "Information";

"There is nothing to Undo." ="There is nothing to Undo.";

"About" = "About";

"Other Titles" = "Other Titles";

"Purchase Master levels" = "Purchase Master levels";

"No %@ were found." = "No %@ were found.";

"1/Red" = "1/Red";

"2/Orange" = "2/Orange";

"3/Yellow" = "3/Yellow";

"4/Green" = "4/Green";

"5/Blue" = "5/Blue";

"6/Indigo" = "6/Indigo";

"7/Violet" = "7/Violet";

"8/Black" = "8/Black";

"9/White" = "9/White";

"That is easy. There is at least one Naked Single!" = "That is easy. There is at least one Naked Single!";

"Look for at least one Hidden Single." = "Look for at least one Hidden Single.";

"Try looking for one or more Naked Twins." = "Try looking for one or more Naked Twins.";

"There are one or more Hidden Twins." = "There are one or more Hidden Twins.";

"There is at least one Naked Triplet." = "There is at least one Naked Triplet.";

"Look for at least one Hidden Triplet." = "Look for at least one Hidden Triplet.";

"Look for Naked Quadruplets." = "Look for Naked Quadruplets.";

"There is at least one Hidden Quadruplet. These are very difficult to spot." = "There is at least one Hidden Quadruplet. These are very difficult to spot.";

"Look for an X-Wing." = "Look for an X-Wing.";

"Can you see the Swordfish?" = "Can you see the Swordfish?";

"There is a Jellyfish lurking in there." = "There is a Jellyfish lurking in there.";

"Try using the Ball of String." = "Try using the Ball of String.";

"Suggest a Technique" = "Suggest a Technique";

"Naked Single" = "Naked Single";

"Naked Twins" = "Naked Twins";

"Naked Triplets" = "Naked Triplets";

"Naked Quadruplets" = "Naked Quadruplets";

"Hidden Single" = "Hidden Single";

"Hidden Twins" = "Hidden Twins";

"Hidden Triplets" = "Hidden Triplets";

"Hidden Quadruplets" = "Hidden Quadruplets";

"X-Wings" = "X-Wings";

"Swordfish" = "Swordfish";

"Jellyfish" = "Jellyfish";

"%@ Level\nNone Available. You have yet to complete a SuDoku at this level!" = "%@ Level\nNone Available. You have yet to complete a SuDoku at this level!";

"%@ Level\n\nGames Played: %d\n\nBest Score: %d\nWorst Score: %d\nAverage Score: %d\n\nFastest Time: %@\nSlowest Time: %@\nAverage Time: %@" = "%@ Level\n\nGames Played: %d\n\nBest Score: %d\nWorst Score: %d\nAverage Score: %d\n\nFastest Time: %@\nSlowest Time: %@\nAverage Time: %@";

"Advanced Stats" = "Advanced Stats";

"Score: %d\n\nYou have completed:\n%d Simple SuDoku(s)\n%d Easy SuDoku(s)\n%d Medium SuDoku(s)\n%d Hard SuDoku(s)\n%d Very Hard SuDoku(s)\n%d Master SuDoku(s)" = "Score: %d\n\nYou have completed:\n%d Simple SuDoku(s)\n%d Easy SuDoku(s)\n%d Medium SuDoku(s)\n%d Hard SuDoku(s)\n%d Very Hard SuDoku(s)\n%d Master SuDoku(s)";

"Information" = "Information";

"Your rating: %@" = "Your rating: %@";

"Simple" = "Simple";

"Easy" = "Easy";

"Medium" = "Medium";

"Hard" = "Hard";

"Very Hard" = "Very Hard";

"Sudoku Master!" = "Sudoku Master!";

"Clear All Dark Gray" = "Clear All Dark Gray";

"Clear All Red" = "Clear All Red";

"Clear All Orange" = "Clear All Orange";

"Clear All Yellow" = "Clear All Yellow";

"Clear All Green" = "Clear All Green";

"Clear All Blue" = "Clear All Blue";

"Clear All 1s" = "Clear All 1s";

"Clear All 2s" = "Clear All 2s";

"Clear All 3s" = "Clear All 3s";

"Clear All 4s" = "Clear All 4s";

"Clear All 5s" = "Clear All 5s";

"Clear All 6s" = "Clear All 6s";

"Clear All 7s" = "Clear All 7s";

"Clear All 8s" = "Clear All 8s";

"Clear All 9s" = "Clear All 9s";

"Clear All Numbers" = "Clear All Numbers";

"Clear Numbers By Color" = "Clear Numbers By Color";

"Clear Numbers By Value" = "Clear Numbers By Value";

"Clear All Candidates" = "Clear All Candidates";

"Clear Candidates By Value" = "Clear Candidates By Value";

"Dark Gray" = "Dark Gray";

"Red" = "Red";

"Orange" = "Orange";

"Yellow" = "Yellow";

"Green" = "Green";

"Blue" = "Blue";

"Clear Numbers" = "Clear Numbers";

"Clear Candidates" = "Clear Candidates";

"Change Number Colors" = "Change Number Colors";

"Plain Numbers" = "Plain Numbers";

"Sketch Numbers" = "Sketch Numbers";

"Alpha" = "Alpha";

"Roman" = "Roman";

"L.C.D." = "L.C.D.";

"Pool" = "Pool";

"Bugs" = "Bugs";

"Flowers" = "Flowers";

"Kanji" = "Kanji";

"Yang Yang" = "Yang Yang";

"1980s" = "1980s";

"Mellow Yellow" = "Mellow Yellow";

"Plain" = "Plain";

"Symbol" = "Symbol";

"Shadow" = "Shadow";

"Pitch" = "Pitch";

"Symmetrical" = "Symmetrical";

"Symmetrical and Assymetrical" = "Symmetrical and Assymetrical";

"Assymetrical" = "Assymetrical";

"Sounds On" = "Sounds On";

"Startup" = "Startup";

"Close" = "Close";

"Transform" = "Transform";

"Click" = "Click";

"Hint Controls" = "Hint Controls";

"Eraser (Undo)" = "Eraser (Undo)";

"Keypad is Draggable" = "Keypad is Draggable";

"Keypad is Sticky" = "Keypad is Sticky";

"Autohide Keypad" = "Autohide Keypad";

"OK always hides Keypad" = "OK always hides Keypad";

"Fixed keypad" = "Fixed keypad";

"Flying keypad" = "Flying keypad";

"Flying keypad options" = "Flying keypad options";

"Number Styles" = "Number Styles";

"Picture Styles" = "Picture Styles";

"Grid Styles" = "Grid Styles";

"Skin Presets" = "Skin Presets";

"Symmetry" = "Symmetry";

"Sounds" = "Sounds";

"Keypad Type" = "Keypad Type";

"Reset Statistics" = "Reset Statistics";

"Create New Sudoku" = "Create New Sudoku";

"Enter Own Sudoku" = "Enter Own Sudoku";

"Solve!" = "Solve!";

"More Tools" = "More Tools";

"Options" = "Options";

"Advanced Statistics" = "Advanced Statistics";

"Game Center" = "Game Center";

"About" = "About";

"Credits" = "Credits";

"Help" = "Help";

"Other Titles" = "Other Titles";

"Highlight Singles" = "Highlight Singles";

"Highlight Twins" = "Highlight Twins";

"Highlight Triplets" = "Highlight Triplets";

"Highlight Quadruplets" = "Highlight Quadruplets";

"Highlight Hidden Singles" = "Highlight Hidden Singles";

"Highlight Hidden Twins" = "Highlight Hidden Twins";

"Highlight Hidden Triplets" = "Highlight Hidden Triplets";

"Highlight Hidden Quadruplets" = "Highlight Hidden Quadruplets";

"Direct Hidden Twins" = "Direct Hidden Twins";

"Direct Hidden Triplets" = "Direct Hidden Triplets";

"Direct Hidden Quadruplets" = "Direct Hidden Quadruplets";

"Hidden Subset" = "Hidden Subset";

"Direct Hidden Subset" = "Direct Hidden Subset";

"Highlight X-Wings" = "Highlight X-Wings";

"Highlight Swordfish" = "Highlight Swordfish";

"Highlight Jellyfish" = "Highlight Jellyfish";

"Intersections" = "Intersections";

"Suggest a Cell" = "Suggest a Cell";

"Suggest a Value" = "Suggest a Value";

"XY Wing Subset" = "XY Wing Subset";

"XYZ Wing Subset" = "XYZ Wing Subset";

"Aligned Pair Exclusion" = "Aligned Pair Exclusion";

"Aligned Triplet Exclusion" = "Aligned Triplet Exclusion";

"Aligned Quad Exclusion" = "Aligned Quad Exclusion";

"Wrong Values" = "Wrong Values";

"Suggest a Cell/Value" = "Suggest a Cell/Value";

"Naked Subset" = "Naked Subset";

"Hidden Subset" = "Hidden Subset";

"Fisherman Subset" = "Fisherman Subset";

"Intersections Subset" = "Intersections Subset";

"XY/Z Wings Subset" = "XY/Z Wings Subset";

"1 / Red" = "1 / Red";

"2 / Orange" = "2 / Orange";

"3 / Yellow" = "3 / Yellow";

"4 / Green" = "4 / Green";

"5 / Blue" = "5 / Blue";

"6 / Indigo" = "6 / Indigo";

"7 / Violet" = "7 / Violet";

"8 / Black" = "8 / Black";

"9 / White" = "9 / White";

"Possible Values (10%)" = "Possible Values (10%)";

"Possible Cells (10%)" = "Possible Cells (10%)";

"Impossible Cells (10%)" = "Impossible Cells (10%)";

"Duplicate Box/Row/Col (10%)" = "Duplicate Box/Row/Col (10%)";

"Duplicate Values (10%)" = "Duplicate Values (10%)";

"Show Candidates (10%)" = "Show Candidates (10%)";

"Calculate Candidates (25%)" = "Calculate Candidates (25%)";

"Auto Candidates (75%)" = "Auto Candidates (75%)";

"Suggest a Technique (35%)" = "Suggest a Technique (35%)";

"Rotate Clockwise" = "Rotate Clockwise";

"Rotate Anti Clockwise" = "Rotate Anti Clockwise";

"Flip" = "Flip";

"Mirror" = "Mirror";

"Mark Red" = "Mark Red";

"Mark Green" = "Mark Green";

"Mark Blue" = "Mark Blue";

"Mark Orange" = "Mark Orange";

"Back" = "Back";

"Cancel" = "Cancel";